import NavBar from './NavBar'
import './Homepage.css'
import hero from '../assets/final.png'

function HomePage () {
    return(
        <div className='main'>
            <NavBar />
            <div className='Hero' >
                <div className='First'>
                <h1>مدرسة نجيب محفوظ الرسميه لغات</h1>
                <p>موسسه تهدف الي خلق جيل واعي و قادر على مواجهة تحديات الحياة</p>
                <button>المزيد</button>
                </div>
              <div className='Hero-image'>
                <img src={hero} alt='Hero' />
              </div>
            </div>
            <div className='why'>
                <h2>من نحن </h2>
                <div className='cards'>
                    <div className='Card-1'>
                        <h3>نحن</h3>
                        <p> مؤسسه تعليميه تهدف الى خلق جيل قادر على مواجهة صعوبات  الحياه</p>
                    </div>
                    <div className='Card-2'>
                        <h3>نقدم</h3>
                        <p>تعليم على اعلى مستوى عن طريق المعلمين المجتهدين و الأداره التي تضع مصلحة الطلبه في المقدمه دائمًا بقيادة الأستاذ و القائد الأستاذ أنصاري عبدالرحمن/</p>
                    </div>
                    <div className='Card-3'>
                        <h3>نمتلك </h3>
                        <p>معلمين على أعلى مستوى ولا يقتصر التعليم عندنا على دراسة المواد فقط بل الى تحسين أخلاق الطلبه أيضا و طلبتنا يتألقون دائما في جميع المسباقات والأنشطه</p>
                         </div>
                </div>
                <div className='Nature'>
                    <h2>طبيعة الدراسه هنا</h2>
                    <ul>
                    <li><p>اليوم الدراسي يبدأ من الساعه 7:30 صباحا و ينتهي الساعه 3 عصرا .</p> </li>
                  <li>  <p>يقوم الطلاب بأداء بعض الأنشطه و الحركات البسيطه بالصباح في الطابور الصباحي .</p> </li>
                   <li> <p>يشارك الطلبه بنشاطات عديده خلال العام الدراسي و في الأجازه مثل المسرح و البرمجه و الموسيقى و الرسم و حتى صناعه و أصلاح بعض الأشياء بالمدرسه بالنشاط الصناعي و أيضا زراعة النباتات بالحديقه بالنشاط الزراعي . </p> </li>
                    <li><p>نقوم بتعزيز مستوى اللغات الأجنبيه عند الطلبه من خلال نشاطات و كورسات مجانيه مثل كورس اللغه الأنجليزيه للأستاذ أنصاري عبدالرحمن مدير المجمع و نشاط اللغه الأيطاليه لسنيور وائل .</p> </li>
                   <li> <p> نتيح لطلابنا الأشتراك في كافة المسابقات العلميه و الرياضيه مثل بطولات الكاريتيه و مساباقات توفاس العالميه .</p> </li>
                   <li> <p>نقوم بتعليم الطلاب الألتزام بالوقت المحدد عن طريق تعليمهم القدوم مبكرا الى الطابور الصباحي .</p></li>
                   <li> <p>نقوم بمعاقبة الطلاب الغير ملتزمين بالقواعد لجعلهم يلتزموا بالقواعد بالمدرسه .</p> </li>
                    </ul>
    
                    
                </div>
            </div>
        </div>
    )
}

export default HomePage